---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SweepBaseFloorSubcategoryId
source: html/a5919276-540e-1d9c-e094-ff5ebc6d7113.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SweepBaseFloorSubcategoryId Property

"Subcategory of Floors"

## Syntax (C#)
```csharp
public static ForgeTypeId SweepBaseFloorSubcategoryId { get; }
```